99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_twt/esp32_mquickjs_wifi_twt_broadcast_timer.c
    error = esp_event_post(ESP32QJS_WIFI_RADIO_CONTROL_EVENT, ESP32_MQUICKJS_WIFI_BTWT_FENCE_EVENT,
        &event, sizeof(event), 0);
    portENTER_CRITICAL_SAFE(&s_btwt_timer_lock);
    bool exact = entry->result.identity == identity && entry->result.held && entry->result.fence_sequence == event.sequence;
    if (exact) {
        entry->result.fence_pending = false;
        if (error == ESP_OK && s_btwt_timer.snapshot.revision == cut->timer_revision) {
            entry->result.fence_posted = true;
            *sequence = event.sequence; /* Preserve an early handler's seen bit. */
        } else {
            entry->result.fence_posted = entry->result.fence_seen = false;
            if (error == ESP_OK) error = ESP_ERR_NOT_FINISHED;
        }
    } else if (error == ESP_OK) error = ESP_ERR_INVALID_STATE;
    portEXIT_CRITICAL_SAFE(&s_btwt_timer_lock);
    return error;
}
void esp32_mquickjs_wifi_btwt_setup_observe_fence(const esp32_mquickjs_wifi_btwt_event_fence_t *event)
{
    if (event == NULL || event->slot >= 32 || !event->identity || !event->sequence) return;
    portENTER_CRITICAL_SAFE(&s_btwt_timer_lock);
    btwt_timer_entry_t *entry = s_btwt_timer.entries != NULL ? &s_btwt_timer.entries[event->slot] : NULL;
    if (entry != NULL && entry->result.identity == event->identity && entry->result.held && entry->result.cancelled &&
        entry->result.fence_sequence == event->sequence && s_btwt_timer.snapshot.revision == event->cut.timer_revision &&
        (entry->result.fence_pending || entry->result.fence_posted)) entry->result.fence_seen = true;
    portEXIT_CRITICAL_SAFE(&s_btwt_timer_lock);
}
esp_err_t esp32_mquickjs_wifi_btwt_setup_release_native(unsigned slot, uint32_t identity,
    const esp32_mquickjs_wifi_btwt_cut_t *cut, uint32_t sequence)
{
    if (cut == NULL || !sequence) return ESP_ERR_INVALID_ARG;
    esp32_mquickjs_wifi_btwt_cut_t current;
    esp_err_t error = esp32_mquickjs_wifi_btwt_setup_quiescent_native(slot, identity, &current);
    if (error != ESP_OK) return error;
    if (current.tx_revision != cut->tx_revision || current.timer_revision != cut->timer_revision ||
        current.teardown_revision != cut->teardown_revision) return ESP_ERR_NOT_FINISHED;
    portENTER_CRITICAL_SAFE(&s_btwt_timer_lock);
    btwt_timer_entry_t *entry = &s_btwt_timer.entries[slot];
    bool exact = entry->result.identity == identity && entry->result.held && entry->result.cancelled &&
        s_btwt_timer.snapshot.revision == cut->timer_revision && entry->result.fence_sequence == sequence &&
        !entry->result.fence_pending && entry->result.fence_posted && entry->result.fence_seen;
    portEXIT_CRITICAL_SAFE(&s_btwt_timer_lock);
    if (!exact) return ESP_ERR_NOT_FINISHED;
    /* No driver calls under the timer lock. held + cancel_requested prevent
     * same-request admission while releasing the shared native TX scope. */
    if (cut->teardown_revision != 0 &&
        !esp32_mquickjs_wifi_twt_teardown_tx_release_native(identity, cut->teardown_revision)) return ESP_ERR_NOT_FINISHED;
    portENTER_CRITICAL_SAFE(&s_btwt_timer_lock);
    exact = entry->result.identity == identity && entry->result.held && entry->result.cancelled &&
        s_btwt_timer.snapshot.revision == cut->timer_revision && entry->result.fence_sequence == sequence &&
        !entry->result.fence_pending && entry->result.fence_posted && entry->result.fence_seen;
    if (exact) {
        entry->result.held = false;
        entry->result.fence_posted = entry->result.fence_seen = false;
        btwt_timer_changed_locked();
    }
    portEXIT_CRITICAL_SAFE(&s_btwt_timer_lock);
    return exact ? ESP_OK : ESP_ERR_NOT_FINISHED;
}
void esp32_mquickjs_wifi_btwt_timer_bind_response_native(uintptr_t node, uint8_t dialog, const uint8_t parameter[17])
{
    if (parameter == NULL) return;
    unsigned slot = parameter[10] >> 3;
    portENTER_CRITICAL_SAFE(&s_btwt_timer_lock);
    btwt_timer_entry_t *entry = s_btwt_timer.entries != NULL ? &s_btwt_timer.entries[slot] : NULL;
    bool valid = dialog != 0 && entry != NULL && entry->node == node && entry->phase == 30 && entry->active &&
        !entry->busy && entry->dialog == 0 && entry->fault == ESP_OK &&
        !memcmp(entry->parameter, parameter, sizeof(entry->parameter));
    if (valid) { entry->dialog = dialog; btwt_timer_changed_locked(); }
    else btwt_timer_failed_locked(slot, ESP_ERR_INVALID_STATE, ESP32_MQUICKJS_WIFI_BTWT_TIMER_NATIVE);
    portEXIT_CRITICAL_SAFE(&s_btwt_timer_lock);
}
static void btwt_timer_publish_result(unsigned slot, uint32_t identity,
    const esp32_mquickjs_wifi_btwt_event_scope_t *scope, esp_err_t cleanup_error)
{
    portENTER_CRITICAL_SAFE(&s_btwt_timer_lock);
    btwt_timer_entry_t *entry = &s_btwt_timer.entries[slot];
    bool exact = entry->identity == identity;
    if (exact) {
        esp32_mquickjs_wifi_btwt_timer_result_t *result = &entry->result;
        if (scope->seen) {
            if (!result->seen) result->event = scope->event.setup;
            else if (memcmp(&result->event, &scope->event.setup, sizeof(result->event)))
                result->ambiguous = true;
            result->seen = true;
        }
        result->ambiguous |= scope->ambiguous;
        if (result->native_error == ESP_OK)
            result->native_error = entry->fault != ESP_OK ? entry->fault : cleanup_error;
        result->timer_identity = identity;
        result->complete = true;
        result->publishing = scope->seen;
        btwt_timer_changed_locked();
    }
    portEXIT_CRITICAL_SAFE(&s_btwt_timer_lock);
    if (exact && scope->seen) {
        esp_err_t observation_error = esp32_mquickjs_wifi_btwt_event_publish(scope);
        portENTER_CRITICAL_SAFE(&s_btwt_timer_lock);
        if (entry->identity == identity) {
            entry->result.observation_error = observation_error;
            entry->result.publishing = false;
            btwt_timer_changed_locked();
        }
        portEXIT_CRITICAL_SAFE(&s_btwt_timer_lock);
    }
}
void esp32_mquickjs_wifi_btwt_setup_tx_complete_native(unsigned slot, uint32_t identity,
    uintptr_t node, uint8_t dialog, const uint8_t parameter[17], uint8_t status)
{
    if (slot >= 32 || !identity || !dialog || parameter == NULL) return;
    portENTER_CRITICAL_SAFE(&s_btwt_timer_lock);
    btwt_timer_entry_t *entry = s_btwt_timer.entries != NULL ? &s_btwt_timer.entries[slot] : NULL;
    bool exact = entry != NULL && entry->result.identity == identity && entry->node == node &&
        entry->phase == 0 && !entry->busy && !entry->result.tx_busy && !entry->result.cancel_requested && !entry->result.complete &&
        !memcmp(entry->parameter, parameter, sizeof(entry->parameter));
    if (exact) { entry->result.tx_busy = true; btwt_timer_changed_locked(); }
    portEXIT_CRITICAL_SAFE(&s_btwt_timer_lock);
    if (!exact) return;
    esp32_mquickjs_wifi_btwt_event_scope_t scope = {0};
    esp_err_t error = ESP_OK;
    if (!esp32_mquickjs_wifi_btwt_event_begin(&scope, WIFI_EVENT_BTWT_SETUP, slot)) error = ESP_ERR_INVALID_STATE;
    else {
        esp32_mquickjs_wifi_twt_sdk_broadcast_tx_complete_native(node, dialog, parameter, status);
        bool ended = esp32_mquickjs_wifi_btwt_event_end(&scope);
        error = scope.error;
        if (error == ESP_OK && (!ended || scope.ambiguous ||
            (status != 1 && (!scope.seen || scope.event.setup.status != BTWT_SETUP_TXFAIL)) ||
            (status == 1 && scope.seen))) error = ESP_ERR_INVALID_STATE;
    }
    portENTER_CRITICAL_SAFE(&s_btwt_timer_lock);
    uint32_t timer_identity = entry->identity;
    entry->result.tx_busy = false;
    btwt_timer_changed_locked();
    if (error == ESP_OK) error = entry->fault;
    if (error == ESP_OK && status == 1 &&
        (entry->phase != 30 || !entry->active || entry->dialog != dialog)) error = ESP_ERR_INVALID_STATE;
    portEXIT_CRITICAL_SAFE(&s_btwt_timer_lock);
    if (error != ESP_OK) {
        btwt_timer_failed(slot, error, ESP32_MQUICKJS_WIFI_BTWT_TIMER_NATIVE);
        if (timer_identity != 0) (void)esp32_mquickjs_wifi_btwt_timer_cancel_native(slot, timer_identity);
    }
    if (error != ESP_OK || status != 1) btwt_timer_publish_result(slot, timer_identity, &scope, error);
}
int esp32_mquickjs_wifi_btwt_response_native(uintptr_t node, const uint8_t body[20])
{
    if (body == NULL || !esp32_mquickjs_wifi_twt_sdk_broadcast_node_matches_native(node)) return -1;
    unsigned slot = body[13] >> 3;
    uint8_t command = (body[6] >> 1) & 7U;
    if (body[2] == 0 || body[3] != 216 || body[4] != 10 || (body[5] & 12U) != 12U ||
        (body[6] & 1U) || command < TWT_ACCEPT) return -1;
    uint32_t identity = 0;
    portENTER_CRITICAL_SAFE(&s_btwt_timer_lock);
    btwt_timer_entry_t *entry = s_btwt_timer.entries != NULL ? &s_btwt_timer.entries[slot] : NULL;
    if (entry != NULL && entry->node == node && entry->phase == 30 && entry->dialog == body[2] &&
        entry->active && !entry->fired && !entry->busy && entry->fault == ESP_OK) {
        identity = entry->identity;
        entry->dialog = 0; entry->active = false; /* One response can consume it. */
        btwt_timer_changed_locked();
    }
    portEXIT_CRITICAL_SAFE(&s_btwt_timer_lock);
    if (identity == 0) return -1;
    esp32_mquickjs_wifi_btwt_event_scope_t scope = {0};
    /* Do not enter the SDK if stop/delete failed: it would replace the shared
     * parameters before setfn notices the still-owned old handle. */
    esp_err_t error = esp32_mquickjs_wifi_btwt_timer_cancel_native(slot, identity);
    if (error != ESP_OK) { btwt_timer_publish_result(slot, identity, &scope, error); return -1; }
    if (!esp32_mquickjs_wifi_btwt_event_begin(&scope, WIFI_EVENT_BTWT_SETUP, slot)) {
        btwt_timer_failed(slot, ESP_ERR_INVALID_STATE, ESP32_MQUICKJS_WIFI_BTWT_TIMER_NATIVE);
        btwt_timer_publish_result(slot, identity, &scope, ESP_ERR_INVALID_STATE); return -1;
    }
    int result = ieee80211_process_btwt_setup_action((void *)node, body);
    bool ended = esp32_mquickjs_wifi_btwt_event_end(&scope);
    error = scope.error;
    if (error == ESP_OK && (!ended || scope.ambiguous || (command != TWT_ACCEPT && !scope.seen)))
        error = ESP_ERR_INVALID_STATE;
    if (command == TWT_ACCEPT) {
        portENTER_CRITICAL_SAFE(&s_btwt_timer_lock);
        entry = &s_btwt_timer.entries[slot];
        bool installed = entry->identity != identity && entry->phase == 31 && entry->active && entry->fault == ESP_OK;
        identity = entry->identity;
        if (error == ESP_OK) error = entry->fault != ESP_OK ? entry->fault : !installed ? ESP_ERR_INVALID_STATE : ESP_OK;
        portEXIT_CRITICAL_SAFE(&s_btwt_timer_lock);
    }
    if (error != ESP_OK) {
        btwt_timer_failed(slot, error, ESP32_MQUICKJS_WIFI_BTWT_TIMER_NATIVE);
        (void)esp32_mquickjs_wifi_btwt_timer_cancel_native(slot, identity);
    }
    if (command != TWT_ACCEPT || error != ESP_OK) btwt_timer_publish_result(slot, identity, &scope, error);
    /* ACCEPT creates a new numeric dwell timer; its native process owns the
     * terminal result. Duplicates/queued old timeouts cannot consume it. */
    return error != ESP_OK ? -1 : result;
}
static void btwt_timer_process(void *argument, uint8_t phase)
{
    uint32_t identity = (uint32_t)(uintptr_t)argument;
    unsigned slot = 32;
    esp32_mquickjs_wifi_btwt_timer_identity_t native = {0};
    portENTER_CRITICAL_SAFE(&s_btwt_timer_lock);
    if (identity != 0U && s_btwt_timer.entries != NULL) {
        for (unsigned i = 0; i < 32; ++i) {
            btwt_timer_entry_t *entry = &s_btwt_timer.entries[i];
            if (entry->identity == identity && entry->phase == phase && entry->active && entry->fired && !entry->busy && entry->fault == ESP_OK) {
                slot = i; native.node = entry->node;
                memcpy(native.parameter, entry->parameter, sizeof(native.parameter));
                entry->active = false; entry->busy = true;
                btwt_timer_changed_locked(); break;
            }
        }
    }
    portEXIT_CRITICAL_SAFE(&s_btwt_timer_lock);
    if (slot == 32) return;
    esp32_mquickjs_wifi_btwt_event_scope_t scope = {0};
    esp_err_t native_error = ESP_OK;
    if (!esp32_mquickjs_wifi_twt_sdk_broadcast_timer_matches_native(slot, phase, &native) ||
        !esp32_mquickjs_wifi_btwt_event_begin(&scope, WIFI_EVENT_BTWT_SETUP, slot)) {
        native_error = ESP_ERR_INVALID_STATE;
    } else {
        if (phase == 30) __real_btwt_setup_timeout_fn_process(native.parameter);
        else __real_btwt_setup_dwell_timeout_fn_process(native.parameter);
        /* The SDK posts SUCCESS before finishing its PM/table writes. Capture
         * synchronously, but do not expose completion until it returns. */
        bool ended = esp32_mquickjs_wifi_btwt_event_end(&scope);
        native_error = scope.error;
        if (native_error == ESP_OK && (!ended || !scope.seen || scope.ambiguous))
            native_error = ESP_ERR_INVALID_STATE;
    }
    if (native_error != ESP_OK)
        btwt_timer_failed(slot, native_error, ESP32_MQUICKJS_WIFI_BTWT_TIMER_NATIVE);
    portENTER_CRITICAL_SAFE(&s_btwt_timer_lock);
    s_btwt_timer.entries[slot].busy = false;
    btwt_timer_changed_locked();
    portEXIT_CRITICAL_SAFE(&s_btwt_timer_lock);
    /* Native response timeout deletes its timer; dwell does not. Both routes
     * now finish the same retained stop/delete suffix, including match failure. */
    esp_err_t cleanup_error = esp32_mquickjs_wifi_btwt_timer_cancel_native(slot, identity);
    btwt_timer_publish_result(slot, identity, &scope, cleanup_error);
}
void __wrap_btwt_setup_timeout_fn_process(void *argument) { btwt_timer_process(argument, 30); }
void __wrap_btwt_setup_dwell_timeout_fn_process(void *argument) { btwt_timer_process(argument, 31); }
void __wrap_ieee80211_close_all_twt_sessions(void)
{
    /* Native connection PM teardown clears both agreement bitmaps but does
     * not retire the broadcast timers. Revoke every callback before returning
     * to the original close; a subsequent association cannot consume it. */
    esp32_mquickjs_wifi_twt_setup_results_connection_closed_native();
    esp32_mquickjs_wifi_twt_setup_timers_connection_closed_native();
    esp32_mquickjs_wifi_twt_information_timers_connection_closed_native();
    esp32_mquickjs_wifi_twt_tx_broadcast_cancel_native();
    uint32_t identities[32] = {0};
    portENTER_CRITICAL_SAFE(&s_btwt_timer_lock);
    if (s_btwt_timer.entries != NULL) {
        for (unsigned i = 0; i < 32; ++i) {
            identities[i] = s_btwt_timer.entries[i].identity;
            s_btwt_timer.entries[i].active = false;
            s_btwt_timer.entries[i].result.native_closed = true;
        }
        btwt_timer_changed_locked();
    }
    portEXIT_CRITICAL_SAFE(&s_btwt_timer_lock);
    for (unsigned i = 0; i < 32; ++i)
        if (identities[i]) (void)esp32_mquickjs_wifi_btwt_timer_cancel_native(i, identities[i]);
    __real_ieee80211_close_all_twt_sessions();
    portENTER_CRITICAL_SAFE(&s_btwt_timer_lock);
    if (s_btwt_timer.entries != NULL) {
        for (unsigned i = 0; i < 32; ++i) {
            btwt_timer_entry_t *entry = &s_btwt_timer.entries[i];
            if (entry->result.identity != 0 && !entry->result.complete) {
                entry->result.complete = true;
                entry->result.native_error = entry->fault != ESP_OK ? entry->fault : ESP_ERR_INVALID_STATE;
            }
        }
        btwt_timer_changed_locked();
    }
    portEXIT_CRITICAL_SAFE(&s_btwt_timer_lock);
}
esp_err_t esp32_mquickjs_wifi_btwt_timer_available_native(unsigned slot)
{
    if (slot >= 32U) return ESP_ERR_INVALID_ARG;
    portENTER_CRITICAL_SAFE(&s_btwt_timer_lock);
    const btwt_timer_entry_t *entry = s_btwt_timer.entries != NULL ? &s_btwt_timer.entries[slot] : NULL;
    esp_err_t error = s_btwt_timer.snapshot.fault;
    if (error == ESP_OK && entry != NULL && (entry->active || entry->busy || entry->result.tx_busy || entry->result.publishing))
        error = ESP_ERR_INVALID_STATE;
    portEXIT_CRITICAL_SAFE(&s_btwt_timer_lock);
    const ETSTimer *timer = (const ETSTimer *)(btwt_setup_timer + 20U * slot);
    return error != ESP_OK ? error : timer->timer_arg != NULL ? ESP_ERR_INVALID_STATE : ESP_OK;
}
esp_err_t esp32_mquickjs_wifi_btwt_timer_error(void)
{
    portENTER_CRITICAL_SAFE(&s_btwt_timer_lock);
    esp_err_t error = s_btwt_timer.snapshot.fault;
    portEXIT_CRITICAL_SAFE(&s_btwt_timer_lock);
    return error;
}
bool esp32_mquickjs_wifi_btwt_timer_result(unsigned slot, uint32_t identity,
    esp32_mquickjs_wifi_btwt_timer_result_t *out)
{
    if (slot >= 32 || identity == 0 || out == NULL) return false;
    portENTER_CRITICAL_SAFE(&s_btwt_timer_lock);
    const btwt_timer_entry_t *entry = s_btwt_timer.entries != NULL ? &s_btwt_timer.entries[slot] : NULL;
    bool exact = entry != NULL && entry->identity == identity;
    if (exact) *out = entry->result;
    portEXIT_CRITICAL_SAFE(&s_btwt_timer_lock);
    return exact;
}
bool esp32_mquickjs_wifi_btwt_setup_result(unsigned slot, uint32_t identity,
    esp32_mquickjs_wifi_btwt_timer_result_t *out)
{
    if (slot >= 32 || !identity || out == NULL) return false;
    portENTER_CRITICAL_SAFE(&s_btwt_timer_lock);
    const btwt_timer_entry_t *entry = s_btwt_timer.entries != NULL ? &s_btwt_timer.entries[slot] : NULL;
    bool exact = entry != NULL && entry->result.identity == identity;
    if (exact) {
        *out = entry->result;
        /* Callback posting/arming faults can occur outside native processing.
         * Expose them without inventing a successful event or retiring storage. */
        if (out->native_error == ESP_OK && entry->fault != ESP_OK) out->native_error = entry->fault;
        if (out->native_error != ESP_OK) out->complete = true;
        if (entry->busy || out->tx_busy) out->complete = false;
    }
    portEXIT_CRITICAL_SAFE(&s_btwt_timer_lock);
    return exact;
}
void esp32_mquickjs_wifi_btwt_timer_snapshot(esp32_mquickjs_wifi_btwt_timer_snapshot_t *out)
{
    if (out == NULL) return;
    portENTER_CRITICAL_SAFE(&s_btwt_timer_lock);
    *out = s_btwt_timer.snapshot;
    if (s_btwt_timer.entries != NULL) {
        for (unsigned i = 0; i < 32; ++i) {
            const btwt_timer_entry_t *entry = &s_btwt_timer.entries[i];
            uint32_t bit = UINT32_C(1) << i;
            if (entry->active) out->active_mask |= bit;
            if (entry->fired) out->fired_mask |= bit;
            if (entry->busy) out->busy_mask |= bit;
            if (entry->fault != ESP_OK) out->fault_mask |= bit;
            if (entry->cleanup_error != ESP_OK) out->cleanup_mask |= bit;
            if (entry->result.complete) out->complete_mask |= bit;
            if (entry->result.observation_error != ESP_OK) out->observation_error_mask |= bit;
        }
    }
    portEXIT_CRITICAL_SAFE(&s_btwt_timer_lock);
}
#endif
